; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p14---int100n150-m25---int100c110---s479---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 - fuellevel
)

(:init
(sum level0 level3 level3)
(sum level0 level13 level13)
(sum level0 level19 level19)
(sum level0 level20 level20)
(sum level1 level3 level4)
(sum level1 level13 level14)
(sum level1 level19 level20)
(sum level1 level20 level21)
(sum level2 level3 level5)
(sum level2 level13 level15)
(sum level2 level19 level21)
(sum level2 level20 level22)
(sum level3 level3 level6)
(sum level3 level13 level16)
(sum level3 level19 level22)
(sum level3 level20 level23)
(sum level4 level3 level7)
(sum level4 level13 level17)
(sum level4 level19 level23)
(sum level4 level20 level24)
(sum level5 level3 level8)
(sum level5 level13 level18)
(sum level5 level19 level24)
(sum level5 level20 level25)
(sum level6 level3 level9)
(sum level6 level13 level19)
(sum level6 level19 level25)
(sum level6 level20 level26)
(sum level7 level3 level10)
(sum level7 level13 level20)
(sum level7 level19 level26)
(sum level7 level20 level27)
(sum level8 level3 level11)
(sum level8 level13 level21)
(sum level8 level19 level27)
(sum level8 level20 level28)
(sum level9 level3 level12)
(sum level9 level13 level22)
(sum level9 level19 level28)
(sum level9 level20 level29)
(sum level10 level3 level13)
(sum level10 level13 level23)
(sum level10 level19 level29)
(sum level10 level20 level30)
(sum level11 level3 level14)
(sum level11 level13 level24)
(sum level11 level19 level30)
(sum level11 level20 level31)
(sum level12 level3 level15)
(sum level12 level13 level25)
(sum level12 level19 level31)
(sum level12 level20 level32)
(sum level13 level3 level16)
(sum level13 level13 level26)
(sum level13 level19 level32)
(sum level13 level20 level33)
(sum level14 level3 level17)
(sum level14 level13 level27)
(sum level14 level19 level33)
(sum level14 level20 level34)
(sum level15 level3 level18)
(sum level15 level13 level28)
(sum level15 level19 level34)
(sum level15 level20 level35)
(sum level16 level3 level19)
(sum level16 level13 level29)
(sum level16 level19 level35)
(sum level16 level20 level36)
(sum level17 level3 level20)
(sum level17 level13 level30)
(sum level17 level19 level36)
(sum level17 level20 level37)
(sum level18 level3 level21)
(sum level18 level13 level31)
(sum level18 level19 level37)
(sum level18 level20 level38)
(sum level19 level3 level22)
(sum level19 level13 level32)
(sum level19 level19 level38)
(sum level19 level20 level39)
(sum level20 level3 level23)
(sum level20 level13 level33)
(sum level20 level19 level39)
(sum level20 level20 level40)
(sum level21 level3 level24)
(sum level21 level13 level34)
(sum level21 level19 level40)
(sum level21 level20 level41)
(sum level22 level3 level25)
(sum level22 level13 level35)
(sum level22 level19 level41)
(sum level22 level20 level42)
(sum level23 level3 level26)
(sum level23 level13 level36)
(sum level23 level19 level42)
(sum level23 level20 level43)
(sum level24 level3 level27)
(sum level24 level13 level37)
(sum level24 level19 level43)
(sum level24 level20 level44)
(sum level25 level3 level28)
(sum level25 level13 level38)
(sum level25 level19 level44)
(sum level25 level20 level45)
(sum level26 level3 level29)
(sum level26 level13 level39)
(sum level26 level19 level45)
(sum level26 level20 level46)
(sum level27 level3 level30)
(sum level27 level13 level40)
(sum level27 level19 level46)
(sum level27 level20 level47)
(sum level28 level3 level31)
(sum level28 level13 level41)
(sum level28 level19 level47)
(sum level28 level20 level48)
(sum level29 level3 level32)
(sum level29 level13 level42)
(sum level29 level19 level48)
(sum level29 level20 level49)
(sum level30 level3 level33)
(sum level30 level13 level43)
(sum level30 level19 level49)
(sum level30 level20 level50)
(sum level31 level3 level34)
(sum level31 level13 level44)
(sum level31 level19 level50)
(sum level31 level20 level51)
(sum level32 level3 level35)
(sum level32 level13 level45)
(sum level32 level19 level51)
(sum level32 level20 level52)
(sum level33 level3 level36)
(sum level33 level13 level46)
(sum level33 level19 level52)
(sum level33 level20 level53)
(sum level34 level3 level37)
(sum level34 level13 level47)
(sum level34 level19 level53)
(sum level34 level20 level54)
(sum level35 level3 level38)
(sum level35 level13 level48)
(sum level35 level19 level54)
(sum level35 level20 level55)
(sum level36 level3 level39)
(sum level36 level13 level49)
(sum level36 level19 level55)
(sum level36 level20 level56)
(sum level37 level3 level40)
(sum level37 level13 level50)
(sum level37 level19 level56)
(sum level37 level20 level57)
(sum level38 level3 level41)
(sum level38 level13 level51)
(sum level38 level19 level57)
(sum level38 level20 level58)
(sum level39 level3 level42)
(sum level39 level13 level52)
(sum level39 level19 level58)
(sum level39 level20 level59)
(sum level40 level3 level43)
(sum level40 level13 level53)
(sum level40 level19 level59)
(sum level40 level20 level60)
(sum level41 level3 level44)
(sum level41 level13 level54)
(sum level41 level19 level60)
(sum level41 level20 level61)
(sum level42 level3 level45)
(sum level42 level13 level55)
(sum level42 level19 level61)
(sum level42 level20 level62)
(sum level43 level3 level46)
(sum level43 level13 level56)
(sum level43 level19 level62)
(sum level43 level20 level63)
(sum level44 level3 level47)
(sum level44 level13 level57)
(sum level44 level19 level63)
(sum level44 level20 level64)
(sum level45 level3 level48)
(sum level45 level13 level58)
(sum level45 level19 level64)
(sum level45 level20 level65)
(sum level46 level3 level49)
(sum level46 level13 level59)
(sum level46 level19 level65)
(sum level46 level20 level66)
(sum level47 level3 level50)
(sum level47 level13 level60)
(sum level47 level19 level66)
(sum level47 level20 level67)
(sum level48 level3 level51)
(sum level48 level13 level61)
(sum level48 level19 level67)
(sum level48 level20 level68)
(sum level49 level3 level52)
(sum level49 level13 level62)
(sum level49 level19 level68)
(sum level49 level20 level69)
(sum level50 level3 level53)
(sum level50 level13 level63)
(sum level50 level19 level69)
(sum level50 level20 level70)
(sum level51 level3 level54)
(sum level51 level13 level64)
(sum level51 level19 level70)
(sum level51 level20 level71)
(sum level52 level3 level55)
(sum level52 level13 level65)
(sum level52 level19 level71)
(sum level52 level20 level72)
(sum level53 level3 level56)
(sum level53 level13 level66)
(sum level53 level19 level72)
(sum level53 level20 level73)
(sum level54 level3 level57)
(sum level54 level13 level67)
(sum level54 level19 level73)
(sum level54 level20 level74)
(sum level55 level3 level58)
(sum level55 level13 level68)
(sum level55 level19 level74)
(sum level55 level20 level75)
(sum level56 level3 level59)
(sum level56 level13 level69)
(sum level56 level19 level75)
(sum level56 level20 level76)
(sum level57 level3 level60)
(sum level57 level13 level70)
(sum level57 level19 level76)
(sum level57 level20 level77)
(sum level58 level3 level61)
(sum level58 level13 level71)
(sum level58 level19 level77)
(sum level58 level20 level78)
(sum level59 level3 level62)
(sum level59 level13 level72)
(sum level59 level19 level78)
(sum level59 level20 level79)
(sum level60 level3 level63)
(sum level60 level13 level73)
(sum level60 level19 level79)
(sum level60 level20 level80)
(sum level61 level3 level64)
(sum level61 level13 level74)
(sum level61 level19 level80)
(sum level61 level20 level81)
(sum level62 level3 level65)
(sum level62 level13 level75)
(sum level62 level19 level81)
(sum level62 level20 level82)
(sum level63 level3 level66)
(sum level63 level13 level76)
(sum level63 level19 level82)
(sum level63 level20 level83)
(sum level64 level3 level67)
(sum level64 level13 level77)
(sum level64 level19 level83)
(sum level64 level20 level84)
(sum level65 level3 level68)
(sum level65 level13 level78)
(sum level65 level19 level84)
(sum level66 level3 level69)
(sum level66 level13 level79)
(sum level67 level3 level70)
(sum level67 level13 level80)
(sum level68 level3 level71)
(sum level68 level13 level81)
(sum level69 level3 level72)
(sum level69 level13 level82)
(sum level70 level3 level73)
(sum level70 level13 level83)
(sum level71 level3 level74)
(sum level71 level13 level84)
(sum level72 level3 level75)
(sum level73 level3 level76)
(sum level74 level3 level77)
(sum level75 level3 level78)
(sum level76 level3 level79)
(sum level77 level3 level80)
(sum level78 level3 level81)
(sum level79 level3 level82)
(sum level80 level3 level83)
(sum level81 level3 level84)

(connected l0 l1)
(fuelcost level20 l0 l1)
(connected l0 l3)
(fuelcost level13 l0 l3)
(connected l0 l4)
(fuelcost level19 l0 l4)
(connected l1 l0)
(fuelcost level20 l1 l0)
(connected l1 l2)
(fuelcost level13 l1 l2)
(connected l1 l3)
(fuelcost level13 l1 l3)
(connected l1 l4)
(fuelcost level19 l1 l4)
(connected l2 l1)
(fuelcost level13 l2 l1)
(connected l2 l3)
(fuelcost level3 l2 l3)
(connected l3 l0)
(fuelcost level13 l3 l0)
(connected l3 l1)
(fuelcost level13 l3 l1)
(connected l3 l2)
(fuelcost level3 l3 l2)
(connected l4 l0)
(fuelcost level19 l4 l0)
(connected l4 l1)
(fuelcost level19 l4 l1)

(at t0 l1)
(fuel t0 level84)
(= (total-cost) 0)

(at p0 l2)
(at p1 l3)
(at p2 l1)
(at p3 l0)
(at p4 l2)
(at p5 l2)
(at p6 l2)
(at p7 l0)
(at p8 l3)
(at p9 l3)
(at p10 l1)
(at p11 l3)
(at p12 l3)
(at p13 l2)
)

(:goal
(and
(at p0 l1)
(at p1 l0)
(at p2 l4)
(at p3 l3)
(at p4 l1)
(at p5 l3)
(at p6 l1)
(at p7 l3)
(at p8 l4)
(at p9 l2)
(at p10 l2)
(at p11 l0)
(at p12 l1)
(at p13 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 0 of 14
2. (load p10 t0 l1)
   deleted: (at p10 l1)
   added: (in p10 t0)
   goals met: 0 of 14
3. (drive t0 l1 l3 level71 level13 level84)
   deleted: (at t0 l1) (fuel t0 level84)
   added: (at t0 l3) (fuel t0 level71)
   goals met: 0 of 14
4. (load p9 t0 l3)
   deleted: (at p9 l3)
   added: (in p9 t0)
   goals met: 0 of 14
5. (load p8 t0 l3)
   deleted: (at p8 l3)
   added: (in p8 t0)
   goals met: 0 of 14
6. (load p12 t0 l3)
   deleted: (at p12 l3)
   added: (in p12 t0)
   goals met: 0 of 14
7. (load p11 t0 l3)
   deleted: (at p11 l3)
   added: (in p11 t0)
   goals met: 0 of 14
8. (load p1 t0 l3)
   deleted: (at p1 l3)
   added: (in p1 t0)
   goals met: 0 of 14
9. (drive t0 l3 l2 level68 level3 level71)
   deleted: (at t0 l3) (fuel t0 level71)
   added: (at t0 l2) (fuel t0 level68)
   goals met: 0 of 14
10. (unload p9 t0 l2)
   deleted: (in p9 t0)
   added: (at p9 l2)
   goals met: 1 of 14
11. (unload p10 t0 l2)
   deleted: (in p10 t0)
   added: (at p10 l2)
   goals met: 2 of 14
12. (load p6 t0 l2)
   deleted: (at p6 l2)
   added: (in p6 t0)
   goals met: 2 of 14
13. (load p5 t0 l2)
   deleted: (at p5 l2)
   added: (in p5 t0)
   goals met: 2 of 14
14. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 2 of 14
15. (load p13 t0 l2)
   deleted: (at p13 l2)
   added: (in p13 t0)
   goals met: 2 of 14
16. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 2 of 14
17. (drive t0 l2 l1 level55 level13 level68)
   deleted: (at t0 l2) (fuel t0 level68)
   added: (at t0 l1) (fuel t0 level55)
   goals met: 2 of 14
18. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 3 of 14
19. (unload p12 t0 l1)
   deleted: (in p12 t0)
   added: (at p12 l1)
   goals met: 4 of 14
20. (unload p13 t0 l1)
   deleted: (in p13 t0)
   added: (at p13 l1)
   goals met: 5 of 14
21. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 6 of 14
22. (unload p6 t0 l1)
   deleted: (in p6 t0)
   added: (at p6 l1)
   goals met: 7 of 14
23. (drive t0 l1 l4 level36 level19 level55)
   deleted: (at t0 l1) (fuel t0 level55)
   added: (at t0 l4) (fuel t0 level36)
   goals met: 7 of 14
24. (unload p2 t0 l4)
   deleted: (in p2 t0)
   added: (at p2 l4)
   goals met: 8 of 14
25. (unload p8 t0 l4)
   deleted: (in p8 t0)
   added: (at p8 l4)
   goals met: 9 of 14
26. (drive t0 l4 l0 level17 level19 level36)
   deleted: (at t0 l4) (fuel t0 level36)
   added: (at t0 l0) (fuel t0 level17)
   goals met: 9 of 14
27. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 9 of 14
28. (load p7 t0 l0)
   deleted: (at p7 l0)
   added: (in p7 t0)
   goals met: 9 of 14
29. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 10 of 14
30. (unload p11 t0 l0)
   deleted: (in p11 t0)
   added: (at p11 l0)
   goals met: 11 of 14
31. (drive t0 l0 l3 level4 level13 level17)
   deleted: (at t0 l0) (fuel t0 level17)
   added: (at t0 l3) (fuel t0 level4)
   goals met: 11 of 14
32. (unload p3 t0 l3)
   deleted: (in p3 t0)
   added: (at p3 l3)
   goals met: 12 of 14
33. (unload p5 t0 l3)
   deleted: (in p5 t0)
   added: (at p5 l3)
   goals met: 13 of 14
34. (unload p7 t0 l3)
   deleted: (in p7 t0)
   added: (at p7 l3)
   goals met: 14 of 14
